Tekla Open API Reference for Tekla Structures 2025
IAxisAlignedBoundingBox Methods
The IAxisAlignedBoundingBox type exposes the following members.
Methods
Name | Description
GetAxisAlignedBoundingBox
 Gets the bounding box for the current object in the global axis coordinate system.
Top
See Also
Reference
IAxisAlignedBoundingBox Interface
Tekla.Structures.Drawing Namespace